# NotAllowedToModifyGroupElementsError Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ConnectorFailures..::..NotAllowedToModifyGroupElementsError Property
BuiltInFailures..::..ConnectorFailures Class See Also
---
Connection to a group failed. Modification of elements within a group is not allowed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NotAllowedToModifyGroupElementsError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NotAllowedToModifyGroupElementsError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NotAllowedToModifyGroupElementsError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ConnectorFailures Class
Autodesk.Revit.DB Namespace